Autodesk.Revit.DB.FilterCategoryRule.AllCategoriesFilterable(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Checks that all of the given categories are filterable.
categories:
The set of categories to check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FilterCategoryRule.SetCategories(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the rule's categories.
categories:
The categories.
Returns:
True if the set of categories was changed, false if no change was necessary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the given categories is not filterable
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FilterCategoryRule.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Constructs a new instance of FilterCategoryRule.
categories:
The set of categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014